app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", "6"]]
---
  def show
    @user = User.find params[:id]